# AutoMullionInteriorGrid2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AutoMullionInteriorGrid2 Property
ParameterTypeId Class See Also
---
"Interior Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AutoMullionInteriorGrid2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AutoMullionInteriorGrid2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AutoMullionInteriorGrid2 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace